* table

  |-----+-------+--------+----------+------------+------------|
  | <r> |   <r> |    <r> |      <r> | <l>        | <l>        |
  |   / |     < |        |        > | <>         | <>         |
  | $x$ | $x^2$ |  $x^3$ |    $x^4$ | $sin(x)$   | $\sqrt{x}$ |
  |-----+-------+--------+----------+------------+------------|
  |  11 |   121 |   1331 |    14641 | 0.19080900 | 3.3166248  |
  |  23 |   529 |  12167 |   279841 | 0.39073113 | 4.7958315  |
  |  35 |  1225 |  42875 |  1500625 | 0.57357644 | 5.9160798  |
  |  77 |  5929 | 456533 | 35153041 | 0.97437006 | 8.7749644  |
  |-----+-------+--------+----------+------------+------------|
  #+TBLFM: $2=$1^2::$3=$1^3::$4=$1^4::$5=sin($1)::$6=sqrt($1)
  #+TBLFM: $2='(* $1 $1);EN::$3='(* $2 $1);EN::$4='(* $3 $1);EN::$5='(sin $1);EN::$6='(sqrt $1);EN

  - group: begin with '/' and split group with '<' and '>'
  - align: <r> to align right, <l> to align left, <c> to align center, <[rlc]\d>, '\d' to declare width
  - tblfm: =org-table-edit-formulas= to edit and =org-table-eval-formula= to eval
  - '::' split fm and maybe set env after ';'
  - eval as lisp function when given a list

* link
  :PROPERTIES:
  :CUSTOM_ID: id
  :END:

  1. [[normal]]

     - first find anchor as

       <<normal>>

     - then find name as

       #+NAME: normal
       | A | B |
       |---+---|
       | 1 | 2 |

     - finally find a heading

  2. [[#id]] find property custom_id set by =org-set-property=

  3. [[*link]] find heading
       
  4. [[file:org.org]]
     
     - [[./org.org]] link begin with '/' or './' treate as a file link

     - [[./org.org::10]] link to file 10 line

     - [[./org.org::normal]] link to file anchor

     - [[./org.org::*link]] link to file headline

     - [[./org.org::#id]] link to file custom_id

     - [[./org.org::/link/]] link to file find regexp

  5. [[https://www.google.com]]

  6. [[elisp:(message "hello world")]] eval elisp code

  7. [[shell:ls]] eval shell code
